{
	"introduction": {
		"title":"Who am I?",
		"description":"<!DOCTYPE html><p>Hey! I'm <strong>Emiliano Ariza Bolaños</strong>, welcome to my portfolio page!</p>\n\n<p>I'm currently an 8th-semester Computer Engineering student at the <strong>National Polytechnic Institute (IPN)</strong>, specifically at <strong>ESIME Culhuacán</strong>. I’ve gained hands-on experience in software development, team collaboration, and problem-solving.</p>\n\n<img src=\"https://res.cloudinary.com/dbk4tk7bl/image/upload/v1743617442/ESIME_yp5rvm.jpg\" alt=\"ESIME Culhuacán\">\n\n<p>Here are some of the courses I’ve taken:</p>\n<ul>\n  <li>Algorithms and Data Structures</li>\n  <li>Operating Systems</li>\n  <li>Database Systems</li>\n  <li>Software Engineering</li>\n  <li>Neural Networks</li>\n</ul>\n\n<p>I love building things. I’m passionate about software development and DevOps, and I’m currently learning more about system administration, Docker, Kubernetes, and cloud infrastructure.</p>\n\n<p><strong>Technical Skillset:</strong></p>\n<ul>\n  <li><strong>Programming Languages:</strong> Python, C++, JavaScript</li>\n  <li><strong>Web Development:</strong> HTML, CSS, Node.js</li>\n  <li><strong>Databases:</strong> MySQL, SQL Server</li>\n  <li><strong>DevOps & Infrastructure:</strong> Docker, Kubernetes (learning), GCP (foundational knowledge)</li>\n  <li><strong>Operating Systems & Tools:</strong> Linux (basic to intermediate), Git, Bash</li>\n</ul>\n\n<p>People who know me would describe me as someone who delivers creative and high-quality solutions. I’m currently looking to land an internship or an entry-level role in <strong>DevOps</strong> or <strong>Software Engineering</strong>.</p>",
		"iconOrUrl": "<i class=\"fa-solid fa-person-through-window\"></i>"
	},
	"projects": [
		{
			"title": "Teacher Grading App",
			"technologies": ["Node.js", "MySQL", "HTML", "CSS", "JavaScript"],
			"description": "<p>This project is a web application designed to let students securely review and grade professors within their institution. In this case, it was tailored specifically for my university.</p>\n\n<p>The core idea was to help students identify the best professors for specific courses and programs. The app was also designed with an administration panel to allow easy management of professors and subjects when needed.</p>\n\n<p><strong>Technologies used:</strong></p>\n<ul>\n  <li><strong>Frontend:</strong> HTML, CSS, JavaScript</li>\n  <li><strong>Backend:</strong> JavaScript (Node.js)</li>\n  <li><strong>Database:</strong> MySQL</li>\n</ul>\n\n<p>I took on the role of both <strong>project manager</strong> and <strong>developer</strong> within a 12-member team. We applied several <strong>SCRUM practices</strong> throughout the development process to stay organized and iterate effectively.</p>\n\n<p>Although the app was never deployed publicly, the project repository is available here:<br>\n<a href=\"https://github.com/EmilianoA-B/Poliprofes\" target=\"_blank\">https://github.com/EmilianoA-B/Poliprofes</a>\n</p>",
			"iconOrUrl": "<i class=\"fa-solid fa-chalkboard-user\"></i>"
		},
		{
			"title": "Small compiler",
			"technologies": ["Python", "emu8086"],
			"description": "<p>This was a co-op project for my Compilers class. The goal was to build a small compiler capable of reading basic arithmetic operations—addition, subtraction, multiplication, and division—and translating them into 8086 assembly code.</p>\n\n<p>The project was developed in <strong>Python</strong> and could parse and translate simple expressions like:</p>\n\n<pre><code>float x ;\nx = 3.5 + 8.4 - 10.3 / 6 ;\n</code></pre>\n\n<p>The syntax was inspired by C++, although tokens needed to be separated by spaces for easier parsing.</p>\n\n<p>This project was a great academic experience and definitely a rewarding challenge. Unfortunately, I no longer have access to the code.</p>",
			"iconOrUrl": "<i class=\"fa-solid fa-window-restore\"></i>"
		},
		{
			"title": "Pattern recognition using PIP",
			"technologies": ["Python"],
			"description": "<p>This project was built to recognize a given pattern in time-series data provided in CSV format. The dataset was processed in Python by reading and storing the values in a dictionary, then analyzing it using the <strong>Perceptually Important Points (PIP)</strong> algorithm.</p>\n\n<p>The PIP algorithm identifies key peaks and valleys in the data by starting with the first and last points, drawing a baseline between them, and iteratively selecting the furthest point from the line until the desired number of significant points is found. This approach was especially useful for detecting patterns based on a defined number of key points.</p>\n\n<p>The application also featured a simple interface using <strong>tkinter</strong>, allowing users to select a CSV file and visualize the processed data as a graph.</p>\n\n<p><strong>Technologies used:</strong> Python, tkinter</p>\n\n<p>The project repository is available at:<br>\n<a href=\"https://github.com/EmilianoA-B/PatternMatchPIP\" target=\"_blank\">https://github.com/EmilianoA-B/PatternMatchPIP</a></p>"
,
			"iconOrUrl": "<i class=\"fa-solid fa-arrow-trend-up\"></i>"
		}
	]
}